jimmywong2003/nrf52_ble_transfer_jpg/ble_app_transfer_jpg/main.c
#define SCHED_MAX_EVENT_DATA_SIZE           APP_TIMER_SCHED_EVENT_DATA_SIZE            /**< Maximum size of scheduler events. */
#ifdef SVCALL_AS_NORMAL_FUNCTION
#define SCHED_QUEUE_SIZE                    40                                         /**< Maximum number of events in the scheduler queue. More is needed in case of Serialization. */
#else
#define SCHED_QUEUE_SIZE                    20                                         /**< Maximum number of events in the scheduler queue. */
#endif


#define TX_POWER_LEVEL                 (4)                                    /**< TX Power Level value. This will be set both in the TX Power service, in the advertising data, and also used to set the radio transmit power. */


#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#ifdef NRF52840_XXAA
#define IMAGE_BUFFER_SIZE 0x4000
#else
#define IMAGE_BUFFER_SIZE 0x1000
#endif

BLE_ITS_DEF(m_its, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE JPG Transfer service instance. */

NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/

#define BATTERY_LEVEL_MEAS_INTERVAL         APP_TIMER_TICKS(1000)                   /**< Battery level measurement interval(ticks). */
#define MIN_BATTERY_LEVEL                   81                                      /**< Minimum simulated battery level. */
#define MAX_BATTERY_LEVEL                   100                                     /**< Maximum simulated 7battery level. */
#define BATTERY_LEVEL_INCREMENT             1                                       /**< Increment between each simulated battery level measurement. */

APP_TIMER_DEF(m_battery_timer_id); /**< Battery timer. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

static nrf_drv_uart_t m_uart = NRF_DRV_UART_INSTANCE(0);
static uint8_t m_rx_byte[UART_RX_BUF_SIZE];

static uint8_t m_rx_image_buffer[IMAGE_BUFFER_SIZE];
static uint16_t m_rx_image_buffer_len = 0;

static uint8_t m_new_command_received = 0;
static uint8_t m_new_resolution, m_new_phy;
static bool m_stream_mode_active = false;
static ble_its_ble_params_info_t m_ble_params_info = { 20, 50, 1, 1 };

static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;              /**< Maximum length of data(in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static uint16_t m_ble_its_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;              /**< Maximum length of data(in bytes) that can be transmitted to the peer by the Nordic UART service module. */


// use of the data transfer
static uint8_t img_data_buffer[BLE_ITS_MAX_DATA_LEN];
static uint32_t img_data_length = BLE_ITS_MAX_DATA_LEN;
static uint8_t m_buffer_transfer_index = 0;
static bool test_flag = false;
static bool start_thoughput_test = false;
static uint32_t frameCount = 0;
static uint32_t frameCount_previous = 0;

static bool m_active = false;
static uint16_t m_ble_mtu_length = 244; // BLE_GATT_ATT_MTU_DEFAULT - 3;
static uint16_t m_ble_dle_length = 244; // BLE_GATT_ATT_MTU_DEFAULT - 3;

static bool m_file_is_sending = false;

typedef enum
{
        PAYLOAD_FILE_OPCODE_PING = 0xA0,
        PAYLOAD_FILE_OPCODE_FILEINFO_RSP = 0xA1,
        PAYLOAD_FILE_OPCODE_MTU_REQ = 0xA2,
        PAYLOAD_FILE_OPCODE_MTU_RSP = 0xA3,
        PAYLOAD_FILE_OPCODE_DATA_REQ = 0xA4,
        PAYLOAD_FILE_OPCODE_DATA_RSP = 0xA5,
        PAYLOAD_FILE_OPCODE_COMPLETE = 0xA6,
        PAYLOAD_FILE_OPCODE_COMPLETE_ACK = 0xA7,
        PAYLOAD_FILE_OPCODE_DATA_RSP_LAST = 0xA8,
} serial_payload_file_cmd_t;

typedef enum
{
        eSERIAL_FILE_OBJECT_STATE_IDLE = 0x00,
        eSERIAL_FILE_OBJECT_STATE_PING,
        eSERIAL_FILE_OBJECT_STATE_GET_FILE_INFO,
        eSERIAL_FILE_OBJECT_STATE_MTU_REQ,
        eSERIAL_FILE_OBJECT_STATE_MTU_RSP,
        eSERIAL_FILE_OBJECT_STATE_DATA_REQ,
        eSERIAL_FILE_OBJECT_STATE_DATA_RSP,
        eSERIAL_FILE_OBJECT_STATE_BLE_TX,
        eSERIAL_FILE_OBJECT_STATE_BLE_COMPLETE,
        eSERIAL_FILE_OBJECT_STATE_DONE
} serial_file_object_state_t;

typedef struct serial_file_object_s
{
        uint32_t filesize;
        uint32_t crc32;
        uint32_t offset_req;
        uint32_t offset_rsp;
        uint32_t length_req;
        uint8_t mtusize;
        // serial_payload_file_cmd_t state;
} serial_file_object_t;

typedef struct serial_object_data_request_s
{
        uint8_t payload_len;
        serial_file_object_state_t opcode;
        uint16_t request_len;
        uint32_t offset_addr;
} serial_object_data_request_t;

static serial_file_object_t m_file_object = { 0 };

static serial_object_data_request_t m_data_request_obj;
static void serial_uart_response(serial_payload_file_cmd_t cmd);
static void transfer_image_buffer(void *p_event_data, uint16_t size);

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
        .adv_data =
        {
                .p_data = m_enc_advdata,
                .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
        },
        .scan_rsp_data =
        {
                .p_data = m_enc_scan_response_data,
                .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

