jimmywong2003/nrf52_ble_transfer_jpg/ble_app_transfer_jpg/main.c
        err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        APP_ERROR_CHECK(err_code);

#if !defined(S112)
        err_code = nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, NRF_SDH_BLE_GAP_DATA_LENGTH);
        APP_ERROR_CHECK(err_code);
#endif
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting
 * advertising.
 */
static void advertising_init(void)
{
        ret_code_t err_code;
        ble_advdata_t advdata;
        ble_advdata_t srdata;

        ble_uuid_t adv_uuids[] = { { BLE_UUID_ITS_SERVICE, NUS_SERVICE_UUID_TYPE } };

        // Build and set advertising data.
        memset(&advdata, 0, sizeof(advdata));

        advdata.name_type = BLE_ADVDATA_FULL_NAME;
        advdata.include_appearance = true;
        advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

        memset(&srdata, 0, sizeof(srdata));
        srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
        srdata.uuids_complete.p_uuids = adv_uuids;

        err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
        APP_ERROR_CHECK(err_code);

        err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data, &m_adv_data.scan_rsp_data.len);
        APP_ERROR_CHECK(err_code);


        ble_gap_adv_params_t adv_params;

        // Set advertising parameters.
        memset(&adv_params, 0, sizeof(adv_params));

        adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
        adv_params.duration        = APP_ADV_DURATION;
        adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
        adv_params.p_peer_addr     = NULL;
        adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
        adv_params.interval        = APP_ADV_INTERVAL;

        err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may
 * need to inform the application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went
 * wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


static void its_data_handler(ble_its_t * p_its, uint8_t const * p_data, uint16_t length)
{

        uint32_t err_code = NRF_SUCCESS;
        // NRF_LOG_HEXDUMP_INFO(p_data, length);
        switch(p_data[0])
        {
        // Take picture
        case APP_CMD_SINGLE_CAPTURE:
        case APP_CMD_SEND_BLE_PARAMS:
                m_new_command_received = p_data[0];

                NRF_LOG_INFO("APP_CMD_SINGLE_CAPTURE");
                serial_uart_response(PAYLOAD_FILE_OPCODE_PING);

                break;

        case APP_CMD_START_STREAM:
                m_stream_mode_active = true;
                m_new_command_received = p_data[0];
                break;

        case APP_CMD_STOP_STREAM:
                m_stream_mode_active = false;
                m_new_command_received = p_data[0];
                break;

        case APP_CMD_CHANGE_RESOLUTION:
                m_new_command_received = APP_CMD_CHANGE_RESOLUTION;
                m_new_resolution = p_data[1];
                break;

        case APP_CMD_CHANGE_PHY:
                m_new_command_received = APP_CMD_CHANGE_PHY;
                m_new_phy = p_data[1];
                break;
        case APP_CMD_SEND_BUFFER_REQ:
                NRF_LOG_INFO("APP_CMD_SEND_BUFFER_REQ");
                m_file_is_sending = true;
                err_code = app_sched_event_put(NULL, 0, transfer_image_buffer);
                APP_ERROR_CHECK(err_code);

                break;

        case APP_CMD_SEND_BUFFER_COMPLETE:
                NRF_LOG_INFO("APP_CMD_SEND_BUFFER_COMPLETE");

                if(m_file_is_sending == true)
                        if(m_file_object.offset_req != m_file_object.filesize)
                                serial_uart_response(PAYLOAD_FILE_OPCODE_DATA_REQ);
                        else
                                m_file_is_sending = false;
                break;

        default:
                NRF_LOG_ERROR("Unknown command!!");
                break;
        }
}

/**@brief Function for initializing services that will be used by the
 * application.
 */
static void
services_init(void)
{
        ret_code_t err_code;
        nrf_ble_qwr_init_t qwr_init = { 0 };

        ble_its_init_t its_init;
        // Initialize Queued Write Module.
        qwr_init.error_handler = nrf_qwr_error_handler;

        err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
        APP_ERROR_CHECK(err_code);

        //
        //        // Initialize NUS.
        // memset(&nus_init, 0, sizeof(nus_init));
        //
        // nus_init.data_handler = nus_data_handler;
        //
        // err_code = ble_nus_init(&m_nus, &nus_init);
        //
        // APP_ERROR_CHECK(err_code);

        // Initialize ITS.
        memset(&its_init, 0, sizeof(its_init));
        its_init.data_handler = its_data_handler;
        err_code = ble_its_init(&m_its, &its_init);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection
 * Parameters Module that are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by
 * simply setting the disconnect_on_fail config parameter, but instead we use
 * the event handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
        ret_code_t err_code;

        if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
        {
                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
                APP_ERROR_CHECK(err_code);
        }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went
 * wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{

        ret_code_t err_code;
        ble_conn_params_init_t cp_init;

        memset(&cp_init, 0, sizeof(cp_init));

        cp_init.p_conn_params = NULL;
        cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
        cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
        cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
        cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
        cp_init.disconnect_on_fail = false;
        cp_init.evt_handler = on_conn_params_evt;
        cp_init.error_handler = conn_params_error_handler;

