jimmywong2003/nrf52_ble_transfer_jpg/ble_app_transfer_jpg/main.c
/**@brief Function for handling the idle state(main loop).
 *
 * @details If there is no pending log operation, then sleep until next the
 * next event occurs.
 */
static void idle_state_handle(void)
{
        app_sched_execute();
        while(NRF_LOG_PROCESS())
                ;
        nrf_pwr_mgmt_run();
}

static void transfer_image_buffer(void *p_event_data, uint16_t size)
{
        uint32_t err_code;

        NRF_LOG_DEBUG("transfer_image_buffer offset %04x m_rx_image_buffer_len = "
                      "%04x m_ble_its_max_data_len = %x",
                      m_file_object.offset_req, m_rx_image_buffer_len, m_ble_its_max_data_len);
        err_code = ble_its_send_buffer(&m_its, m_rx_image_buffer,
                                       m_rx_image_buffer_len, m_ble_its_max_data_len);
        APP_ERROR_CHECK(err_code);
        nrf_delay_ms(1);
        m_rx_image_buffer_len = 0;
}

static uint32_t decode_received_data_handle(serial_payload_file_cmd_t cmd, uint8_t *data, uint16_t len)
{
        uint32_t err_code = NRF_SUCCESS;
        switch(cmd)
        {
        case PAYLOAD_FILE_OPCODE_FILEINFO_RSP:
                m_file_object.filesize = *data;
                m_file_object.filesize += *(data + 1) << 8;
                m_file_object.filesize += *(data + 2) << 16;
                m_file_object.filesize += *(data + 3) << 24;
                m_file_object.offset_req = 0;

                // m_file_object.filesize  = data[1] +(data[2] << 8) +(data[3] << 16) +
                //(data[4] << 24);
                NRF_LOG_INFO("File Size = %04x", m_file_object.filesize);

                ble_its_img_info_t image_info;
                image_info.file_size_bytes = m_file_object.filesize;
                ble_its_img_info_send(&m_its, &image_info);

                data += 4; // shift the crc32
                m_file_object.crc32 = *data;
                m_file_object.crc32 += *(data + 1) << 8;
                m_file_object.crc32 += *(data + 2) << 16;
                m_file_object.crc32 += *(data + 3) << 24;

                NRF_LOG_INFO("CRC32  = %04x", m_file_object.crc32);

                m_file_object.offset_req = 0;

                serial_uart_response(PAYLOAD_FILE_OPCODE_DATA_REQ);
                break;

        case PAYLOAD_FILE_OPCODE_DATA_RSP:
        {
                NRF_LOG_DEBUG("PAYLOAD_FILE_OPCODE_DATA_RSP %x, %x, %x",
                              m_file_object.offset_req, m_rx_image_buffer_len, len);
                if(m_rx_image_buffer_len > IMAGE_BUFFER_SIZE)
                {
                        err_code = NRF_ERROR_DATA_SIZE;
                        APP_ERROR_CHECK(err_code);
                }
                memcpy(m_rx_image_buffer + m_rx_image_buffer_len, data, len);
                m_rx_image_buffer_len = m_rx_image_buffer_len + len;
        }
        break;

        case PAYLOAD_FILE_OPCODE_DATA_RSP_LAST:
        {
                NRF_LOG_DEBUG("PAYLOAD_FILE_OPCODE_DATA_RSP_LAST %x, %x, %x",
                              m_file_object.offset_req, m_rx_image_buffer_len, len);
                if(m_rx_image_buffer_len > IMAGE_BUFFER_SIZE)
                {
                        err_code = NRF_ERROR_DATA_SIZE;
                        APP_ERROR_CHECK(err_code);
                }

                memcpy(m_rx_image_buffer + m_rx_image_buffer_len, data, len);
                m_rx_image_buffer_len = m_rx_image_buffer_len + len;

                // send the notification
                uint8_t resultData[1];
                resultData[0] = APP_CMD_SEND_BUFFER_REQ;
                m_its.data_handler(&m_its, resultData, 1);
        }
        break;

        default:
                break;
        }

        return err_code;
}

static void serial_uart_response(serial_payload_file_cmd_t cmd)
{
        uint8_t tx_buffer[16];
        uint16_t tx_buffer_len = 0;
        ret_code_t err_code;
        NRF_LOG_DEBUG("serial_uart_response %x", cmd);

        switch(cmd)
        {
        case PAYLOAD_FILE_OPCODE_PING:
                tx_buffer_len = 3;
                tx_buffer[0] = tx_buffer_len;
                tx_buffer[1] = PAYLOAD_FILE_OPCODE_PING;
                tx_buffer[2] = m_ble_mtu_length;
                err_code = nrf_drv_uart_tx(&m_uart, tx_buffer, tx_buffer_len);
                APP_ERROR_CHECK(err_code);
                break;

        case PAYLOAD_FILE_OPCODE_MTU_REQ:
                tx_buffer_len = 3;
                tx_buffer[0] = tx_buffer_len;
                tx_buffer[1] = PAYLOAD_FILE_OPCODE_MTU_REQ;
                tx_buffer[2] = m_ble_mtu_length;
                err_code = nrf_drv_uart_tx(&m_uart, tx_buffer, tx_buffer_len);
                APP_ERROR_CHECK(err_code);
                NRF_LOG_HEXDUMP_INFO(tx_buffer, tx_buffer_len);
                break;

        case PAYLOAD_FILE_OPCODE_DATA_REQ:
                m_data_request_obj.payload_len = 10;
                m_data_request_obj.opcode = PAYLOAD_FILE_OPCODE_DATA_REQ;
                m_data_request_obj.offset_addr = m_file_object.offset_req;
                if(m_file_object.filesize > m_data_request_obj.offset_addr + IMAGE_BUFFER_SIZE)
                {
                        m_data_request_obj.request_len = IMAGE_BUFFER_SIZE;
                }
                else
                {
                        m_data_request_obj.request_len =
                                m_file_object.filesize - m_file_object.offset_req;
                }
                NRF_LOG_DEBUG("PAYLOAD_FILE_OPCODE_DATA_REQ offset_addr= %x, %x",
                              m_data_request_obj.offset_addr, m_data_request_obj.request_len);

                err_code = nrf_drv_uart_tx(&m_uart,(uint8_t *)&m_data_request_obj, sizeof(m_data_request_obj));
                APP_ERROR_CHECK(err_code);

                NRF_LOG_HEXDUMP_DEBUG(&m_data_request_obj, sizeof(m_data_request_obj));
                m_file_object.offset_req += m_data_request_obj.request_len;
                break;
        default:
                break;
        }
}

static void serial_uart_event_handler(nrf_drv_uart_event_t *p_event, void *p_context)
{
        static uint8_t data_array[BLE_ITS_MAX_DATA_LEN];
        static uint8_t index = 0;
        static uint8_t total_len;
        static uint8_t is_first_byte = 1;
        static uint8_t is_end_byte = 0;
        serial_payload_file_cmd_t op_code;
        uint32_t err_code = NRF_SUCCESS;

        switch(p_event->type)
        {
        case NRF_DRV_UART_EVT_RX_DONE:

