jimmywong2003/nrf52_ble_transfer_jpg/ble_app_transfer_jpg/main.c
                NRF_LOG_DEBUG("data %02x, len %02d", p_event->data.rxtx.p_data[0],
                              p_event->data.rxtx.bytes);
                if(is_first_byte == 1)
                {
                        total_len = p_event->data.rxtx.p_data[0];
                        is_first_byte = 0;
                        index++;
                        err_code = nrf_drv_uart_rx(&m_uart, m_rx_byte, total_len);
                        APP_ERROR_CHECK(err_code);
                }
                else
                {
                        op_code = p_event->data.rxtx.p_data[0];
                        memcpy(data_array, p_event->data.rxtx.p_data + 1,
                               p_event->data.rxtx.bytes - 1);

                        err_code = nrf_drv_uart_rx(&m_uart, m_rx_byte, 1);

                        index = 0;
                        is_end_byte = 1;
                }
                if(is_end_byte)
                {
                        decode_received_data_handle(op_code, data_array, total_len - 1);
                        is_end_byte = 0;
                        is_first_byte = 1;
                }
                break;

        case NRF_DRV_UART_EVT_ERROR:
                APP_ERROR_HANDLER(p_event->data.error.error_mask);
                break;

        default:
                // No action.
                break;
        }
}

static uint32_t serial_file_transport_init(void)
{

        uint32_t err_code = NRF_SUCCESS;
        nrf_drv_uart_config_t uart_config = NRF_DRV_UART_DEFAULT_CONFIG;
        NRF_LOG_DEBUG("serial_file_transport_init()");
        //uart_config.baudrate = NRF_UARTE_BAUDRATE_115200;
        uart_config.pseltxd = TX_PIN_NUMBER;
        uart_config.pselrxd = RX_PIN_NUMBER;
        uart_config.pselcts = CTS_PIN_NUMBER;
        uart_config.pselrts = RTS_PIN_NUMBER;
        uart_config.hwfc = false ? NRF_UART_HWFC_ENABLED : NRF_UART_HWFC_DISABLED;
        uart_config.p_context = NULL;

        err_code = nrf_drv_uart_init(&m_uart, &uart_config, serial_uart_event_handler);
        if(err_code != NRF_SUCCESS)
        {
                NRF_LOG_ERROR("Failed initializing uart");
                return err_code;
        }
        err_code = nrf_drv_uart_rx(&m_uart, m_rx_byte, 1);
        if(err_code != NRF_SUCCESS)
        {
                NRF_LOG_ERROR("Failed initializing rx");
        }
        m_active = true;

        return err_code;
}

static uint32_t serial_file_transport_close(void)
{
        if(m_active == true)
        {
                nrf_drv_uart_uninit(&m_uart);
                m_active = false;
        }
        return NRF_SUCCESS;
}

/**@brief Function for application main entry.
 */
int main(void)
{
        bool erase_bonds;
        ret_code_t err_code;

#if defined(BOARD_PCA10056)
        /* enable instruction cache */
        NRF_NVMC->ICACHECNF = (NVMC_ICACHECNF_CACHEEN_Enabled << NVMC_ICACHECNF_CACHEEN_Pos) +
                              (NVMC_ICACHECNF_CACHEPROFEN_Disabled << NVMC_ICACHECNF_CACHEPROFEN_Pos);
#endif

        // Initialize.
        log_init();
        leds_init();
        timers_init();
        buttons_init();
        power_management_init();
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        NRF_LOG_INFO("Peripheral JPG Transfer + NUS.");
        advertising_start();

        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);

        serial_file_transport_init();

        // Enter main loop.
        for(;;)
        {
                idle_state_handle();
        }
}

/**
 * @}
 */
